.config/doom/config.org
#+title: GW's Doom Emacs Config
#+description: My personal Doom Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./config.el :mkdirp yes
#+startup: showeverything
#+options: num:nil

* TABLE OF CONTENTS :toc:
- [[#about-this-config][ABOUT THIS CONFIG]]
  - [[#why-emacs][Why Emacs]]
- [[#sensible-defaults][SENSIBLE DEFAULTS]]
  - [[#setting-the-default-link-opener][Setting the Default Link Opener]]
- [[#gui-changes][GUI CHANGES]]
  - [[#doom-theme][Doom Theme]]
  - [[#title-bar][Title Bar]]
  - [[#beacon][Beacon]]
  - [[#fonts][Fonts]]
  - [[#doom-modeline][Doom-Modeline]]
  - [[#insert-date][Insert Date]]
  - [[#ibuffer][IBuffer]]
  - [[#doom-dashboard][Doom-Dashboard]]
  - [[#menu-bar][Menu Bar]]
- [[#personal-settings][PERSONAL SETTINGS]]
  - [[#chatgpt-shell][Chatgpt-Shell]]
  - [[#dall-e-shell][Dall-E-Shell]]
  - [[#setting-username-and-e-mail][Setting Username and E-Mail]]
  - [[#emojis][Emojis]]
  - [[#line-settings][Line Settings]]
  - [[#rainbow-mode][Rainbow Mode]]
  - [[#xwidgets-browser][xWidgets-Browser]]
  - [[#elfeed][Elfeed]]
  - [[#pojectile-root][Pojectile Root]]
  - [[#open-specific-files][OPEN SPECIFIC FILES]]
- [[#writing-stuff][WRITING STUFF]]
  - [[#typing-practice][Typing Practice]]
  - [[#synosaurus][Synosaurus]]
  - [[#novel][Nov.el]]
  - [[#writegood-mode][Writegood-Mode]]
  - [[#writeroom][Writeroom]]
  - [[#spell-checker][Spell Checker]]
  - [[#olivetti][Olivetti]]
  - [[#palimpsest-mode][Palimpsest-Mode]]
  - [[#grammar-checker][Grammar Checker]]
  - [[#abbrev-mode][Abbrev-Mode]]
- [[#programming-stuff][PROGRAMMING STUFF]]
  - [[#blamer][Blamer]]
  - [[#magit][Magit]]
  - [[#yasnippet][YAsnippet]]
  - [[#web-mode][Web-Mode]]
- [[#dired][Dired]]
  - [[#keybindings-to-open-dired][Keybindings To Open Dired]]
  - [[#keybindings-within-dired][Keybindings Within Dired]]
- [[#mu4e][mu4e]]
  - [[#context][context]]
  - [[#sending][sending]]
  - [[#optional][optional]]
- [[#markdown][Markdown]]
- [[#org-mode][ORG-MODE]]
  - [[#org-settings][Org-Settings]]
  - [[#org-fonts][Org-fonts]]
  - [[#org-agenda][Org-agenda]]
  - [[#org-capture][Org-capture]]
  - [[#org-export][Org-export]]
  - [[#org-journal][Org-journal]]
  - [[#org-auto-tangle][Org-auto-tangle]]
  - [[#custom-functions][Custom Functions]]
  - [[#org-novelist][Org-Novelist]]
  - [[#source-code-block-tag-expansion][Source Code Block Tag Expansion]]
- [[#social-media][Social Media]]
  - [[#mastodon][Mastodon]]
  - [[#lemmy][Lemmy]]
- [[#eshell][Eshell]]
  - [[#aliases][Aliases]]
  - [[#prompt][Prompt]]
- [[#ai-stuff][AI Stuff]]
  - [[#ellama][Ellama]]

* ABOUT THIS CONFIG
This is my Doom Emacs Config. I have built this over the last couple of months mainly from DistroTube's config.
#+begin_src emacs-lisp
;;    _____ __          __
;;  / ____| \ \        / / GameWarrior
;; | |  __   \ \  /\  / /  https://github.com/game-warrior
;; | | |_ |   \ \/  \/ /   @gamewarrior010@social.linux.pizza
;; | |__| |    \  /\  /    https://www.gnu.org/software/emacs/
;;  \_____|     \/  \/     https://:github.com/doomemacs/doomemacs
#+end_src

** Why Emacs
I highly recommend that you checkout this [[https://tecosaur.github.io/emacs-config/config.html][this blog post/config by Tecosaur]] it covers way more about Doom Emacs that I want to here but to quote an excerpt from it.
#+begin_quote
Emacs is not a text editor, this is a common misnomer. It is far more apt to describe Emacs as a Lisp machine providing a generic user-centric text manipulation environment. That’s quite a mouthful. In simpler terms one can think of Emacs as a platform for text-related applications. It’s a vague and generic definition because Emacs itself is generic.

Good with text. How far does that go? A lot further than one initially thinks:

Task planning
File management
Terminal emulation
Email client
Remote server tool
Git frontend
Web client/server
and more…
Ideally, one may use Emacs as the interface to perform input → transform → output cycles, i.e. form a bridge between the human mind and information manipulation.
#+end_quote

* SENSIBLE DEFAULTS
** Setting the Default Link Opener
Setting in which browser EMACS will open links
#+begin_src emacs-lisp
(setq browse-url-browser-function 'browse-url-default-browser)
#+end_src

* GUI CHANGES
** Doom Theme
Setting the theme to doom-one.  To try out new themes, I set a keybinding for counsel-load-theme with 'SPC h t'.

#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
(map! :leader
      :desc "Load new theme" "h t" #'load-theme)
#+end_src

** Title Bar
Change the title bar format
#+begin_src emacs-lisp
    (setq frame-title-format "Hey bro, just FYI, this buffer is called %b or something like that.")
#+end_src

** Beacon
Never lose your cursor.  When you scroll, your cursor will shine!  This is a global minor-mode. Turn it on everywhere with:

#+begin_src emacs-lisp
(beacon-mode 1)
#+end_src

** Fonts
Settings related to fonts within Doom Emacs:
+ 'doom-font' -- standard monospace font that is used for most things in Emacs.
+ 'doom-variable-pitch-font' -- variable font which is useful in some Emacs plugins.
+ 'doom-big-font' -- used in doom-big-font-mode; useful for presentations.

#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec :family "JuliaMono" :size 15)
      doom-variable-pitch-font (font-spec :family "Ubuntu" :size 15)
      doom-big-font (font-spec :family "JuliaMono" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t))
#+END_SRC

** Doom-Modeline
The modeline is the bottom status bar that appears in Emacs windows.  For more information on what is available to configure in the Doom modeline, check out:
https://github.com/seagle0128/doom-modeline

#+begin_src emacs-lisp
(set-face-attribute 'mode-line nil :font "Ubuntu Mono-18")
(setq doom-modeline-height 25     ;; sets modeline height
      doom-modeline-bar-width 5   ;; sets right bar width
      doom-modeline-major-mode-icon t  ;; Whether display the icon for `major-mode'. It respects `doom-modeline-icon'.      doom-modeline-persp-name t  ;; adds perspective name to modeline
      doom-modeline-enable-word-count '(markdown-mode gfm-mode org-mode fountain-mode) ;; Show word count
      )
#+end_src
** Insert Date
Some custom functions to insert the date.  The function 'insert-todays-date' can be used one of three different ways: (1) just the keybinding without the universal argument prefix, (2) with one universal argument prefix, or (3) with two universal argument prefixes.  The universal argument prefix is 'SPC-u' in Doom Emacs (C-u in standard GNU Emacs).  The function 'insert-any-date' only outputs to one format, which is the same format as 'insert-todays-date' without a prefix.

| COMMAND               | EXAMPLE OUTPUT            | KEYBINDING            |
|-----------------------+---------------------------+-----------------------|
| gw/insert-todays-date | Friday, November 19, 2021 | SPC i d t             |
| gw/insert-todays-date | 11-19-2021                | SPC u SPC i d t       |
| gw/insert-todays-date | 2021-11-19                | SPC u SPC u SPC i d t |
| gw/insert-any-date    | Friday, November 19, 2021 | SPC i d a             |

#+begin_src emacs-lisp
(defun gw/insert-todays-date (prefix)
  (interactive "P")
  (let ((format (cond
                 ((not prefix) "%A, %B %d, %Y")
                 ((equal prefix '(4)) "%m-%d-%Y")
                 ((equal prefix '(16)) "%Y-%m-%d"))))
    (insert (format-time-string format))))

(require 'calendar)
(defun gw/insert-any-date (date)
  "Insert DATE using the current locale."
  (interactive (list (calendar-read-date)))
  (insert (calendar-date-string date)))

(map! :leader
      (:prefix ("i d" . "Insert date")
        :desc "Insert any date" "a" #'gw/insert-any-date
        :desc "Insert todays date" "t" #'gw/insert-todays-date))
#+end_src

** IBuffer
I changed some of the default keybindings in IBuffer so that "h" will close the current buffer and "l" will open the currently selected buffer.
#+begin_src emacs-lisp
(map! :after ibuffer
      :map ibuffer-mode-map
      :n "l" #'ibuffer-visit-buffer
      :n "h" #'kill-current-buffer)
#+end_src

** Doom-Dashboard
This is where I customize the DOOM emacs Dashboard. I have a custom banner set. I have also disabled some of the short cuts on the default start page. It will alsow show you a different message based on what OS you are running.
#+begin_src emacs-lisp
(assoc-delete-all "Open project" +doom-dashboard-menu-sections)
(assoc-delete-all "Recently opened files" +doom-dashboard-menu-sections)
;; (remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)

(cond ((eq system-type 'darwin)
       (add-hook! '+doom-dashboard-functions :append
         (insert "\n" (+doom-dashboard--center +doom-dashboard--width "Powered by the  walled garden!"))))
      ((eq system-type 'gnu/linux)
        (add-hook! '+doom-dashboard-functions :append
         (insert "\n" (+doom-dashboard--center +doom-dashboard--width "Powered bye 󰆚 Oxen and 󰻀 Penguins!"))))
      ((eq system-type 'windows-nt)
       (add-hook! '+doom-dashboard-functions :append
         (insert "\n" (+doom-dashboard--center +doom-dashboard--width "Powered by Proprietary Garbage!")))))

(defun gw/doom-art1 ()
  (let* ((banner'("______ _____ ____ ___ ___"
                  "`  _  V  _  V  _ \\|  V  ´"
                  "| | | | | | | | | |     |"
                  "| | | | | | | | | | . . |"
                  "| |/ / \\ \\| | |/ /\\ |V| |"
                  "|   /   \\__/ \\__/  \\| | |"
                  "|  /                ' | |"
                  "| /     E M A C S     \\ |"
                  "´´                     ``"))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line (make-string (max 0 (- longest-line (length line))) 32)))
               "\n"))
     'face 'doom-dashboard-banner)))

;; (setq +doom-dashboard-ascii-banner-fn #'gw/doom-art1)
(setq fancy-splash-image (concat doom-private-dir "images/emacs-e-logo.png"))
#+end_src

** Menu Bar
Setting menu-bar-mode to be disabled because I think it takes up to much screen real estate in the top bar.
#+begin_src emacs-lisp
(add-hook 'doom-after-init-hook (lambda ()
                                  (tool-bar-mode 1)
                                  (tool-bar-mode 0)))
;; (add-hook 'doom-after-init-hook (lambda ()
                                  ;; (menu-bar-mode 1)
                                  ;; (menu-bar-mode 0)))
(setq menu-bar-mode 0)
;; (define-key global-map [menu-bar options] nil)
;; (define-key global-map [menu-bar file] nil)
;; (define-key global-map [menu-bar File] nil)
;; (define-key global-map [menu-bar edit] nil)
;; (define-key global-map [menu-bar tools] nil)
;; (define-key global-map [menu-bar buffer] nil)
;; (define-key global-map [menu-bar help-menu] nil)
;; (define-key global-map [menu-bar Table] nil)
;; (define-key global-map [menu-bar Org] nil)
;; (define-key global-map [menu-bar Text] nil)
;; (define-key global-map [menu-bar Jinx] nil)
#+end_src

* PERSONAL SETTINGS
