.config/doom/config.el
;;    _____ __          __
;;  / ____| \ \        / / GameWarrior
;; | |  __   \ \  /\  / /  https://github.com/game-warrior
;; | | |_ |   \ \/  \/ /   @gamewarrior010@social.linux.pizza
;; | |__| |    \  /\  /    https://www.gnu.org/software/emacs/
;;  \_____|     \/  \/     https://:github.com/doomemacs/doomemacs

(setq browse-url-browser-function 'browse-url-default-browser)

(setq doom-theme 'doom-palenight)
(map! :leader
      :desc "Load new theme" "h t" #'load-theme)

    (setq frame-title-format "Hey bro, just FYI, this buffer is called %b or something like that.")

(beacon-mode 1)

(setq doom-font (font-spec :family "JuliaMono" :size 15)
      doom-variable-pitch-font (font-spec :family "Ubuntu" :size 15)
      doom-big-font (font-spec :family "JuliaMono" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t))

(set-face-attribute 'mode-line nil :font "Ubuntu Mono-18")
(setq doom-modeline-height 25     ;; sets modeline height
      doom-modeline-bar-width 5   ;; sets right bar width
      doom-modeline-major-mode-icon t  ;; Whether display the icon for `major-mode'. It respects `doom-modeline-icon'.      doom-modeline-persp-name t  ;; adds perspective name to modeline
      doom-modeline-enable-word-count '(markdown-mode gfm-mode org-mode fountain-mode) ;; Show word count
      )

(defun gw/insert-todays-date (prefix)
  (interactive "P")
  (let ((format (cond
                 ((not prefix) "%A, %B %d, %Y")
                 ((equal prefix '(4)) "%m-%d-%Y")
                 ((equal prefix '(16)) "%Y-%m-%d"))))
    (insert (format-time-string format))))

(require 'calendar)
(defun gw/insert-any-date (date)
  "Insert DATE using the current locale."
  (interactive (list (calendar-read-date)))
  (insert (calendar-date-string date)))

(map! :leader
      (:prefix ("i d" . "Insert date")
        :desc "Insert any date" "a" #'gw/insert-any-date
        :desc "Insert todays date" "t" #'gw/insert-todays-date))

(map! :after ibuffer
      :map ibuffer-mode-map
      :n "l" #'ibuffer-visit-buffer
      :n "h" #'kill-current-buffer)

(assoc-delete-all "Open project" +doom-dashboard-menu-sections)
(assoc-delete-all "Recently opened files" +doom-dashboard-menu-sections)
;; (remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)

(cond ((eq system-type 'darwin)
       (add-hook! '+doom-dashboard-functions :append
         (insert "\n" (+doom-dashboard--center +doom-dashboard--width "Powered by the  walled garden!"))))
      ((eq system-type 'gnu/linux)
        (add-hook! '+doom-dashboard-functions :append
         (insert "\n" (+doom-dashboard--center +doom-dashboard--width "Powered bye 󰆚 Oxen and 󰻀 Penguins!"))))
      ((eq system-type 'windows-nt)
       (add-hook! '+doom-dashboard-functions :append
         (insert "\n" (+doom-dashboard--center +doom-dashboard--width "Powered by Proprietary Garbage!")))))

;; (defun gw/doom-art1 ()
  ;; (let* ((banner'("______ _____ ____ ___ ___"
                  ;; "`  _  V  _  V  _ \\|  V  ´"
                  ;; "| | | | | | | | | |     |"
                  ;; "| | | | | | | | | | . . |"
                  ;; "| |/ / \\ \\| | |/ /\\ |V| |"
                  ;; "|   /   \\__/ \\__/  \\| | |"
                  ;; "|  /                ' | |"
                  ;; "| /     E M A C S     \\ |"
                  ;; "´´                     ``"))
         ;; (longest-line (apply #'max (mapcar #'length banner))))
    ;; (put-text-property
     ;; (point)
     ;; (dolist (line banner (point))
       ;; (insert (+doom-dashboard--center
                ;; +doom-dashboard--width
                ;; (concat line (make-string (max 0 (- longest-line (length line))) 32)))
               ;; "\n"))
     ;; 'face 'doom-dashboard-banner)))

;; (setq +doom-dashboard-ascii-banner-fn #'gw/doom-art1)
(setq fancy-splash-image (concat doom-private-dir "images/doom-emacs-dash.png"))

(add-hook 'doom-after-init-hook (lambda ()
                                  (tool-bar-mode 1)
                                  (tool-bar-mode 0)))
;; (add-hook 'doom-after-init-hook (lambda ()
                                  ;; (menu-bar-mode 1)
                                  ;; (menu-bar-mode 0)))
;; (setq menu-bar-mode -1)
;; (define-key global-map [menu-bar options] nil)
;; (define-key global-map [menu-bar file] nil)
;; (define-key global-map [menu-bar File] nil)
;; (define-key global-map [menu-bar edit] nil)
;; (define-key global-map [menu-bar tools] nil)
;; (define-key global-map [menu-bar buffer] nil)
;; (define-key global-map [menu-bar help-menu] nil)
;; (define-key global-map [menu-bar Table] nil)
;; (define-key global-map [menu-bar Org] nil)
;; (define-key global-map [menu-bar Text] nil)
;; (define-key global-map [menu-bar Jinx] nil)
