.config/doom/config.org
** Chatgpt-Shell
#+begin_src emacs-lisp
(setq chatgpt-shell-openai-key "placeholder")
;; (setq chatgpt-shell-model-versions	 GPT-4)
#+end_src

** Dall-E-Shell
#+begin_src emacs-lisp
(setq dall-e-shell-openai-key "placeholder")

#+end_src


** Setting Username and E-Mail
#+begin_src emacs-lisp
(setq user-full-name "Gardner Berry"
    user-mail-address "gardner@gardnerberry.com")
#+end_src

** Emojis
Emojify is an Emacs extension to display emojis. It can display github style emojis like :smile: or plain ascii ones like :).

#+begin_src emacs-lisp
;; (use-package emojify
  ;; :hook (after-init . global-emojify-mode))

#+end_src

** Line Settings
I set comment-line to 'SPC TAB TAB' which is a rather comfortable keybinding for me. The standard Emacs keybinding for comment-line is 'C-x C-;'.  The other keybindings are for commands that toggle on/off various line-related settings.  Doom Emacs uses 'SPC t' for "toggle" commands, so I choose 'SPC t' plus 'key' for those bindings.

| COMMAND                  | DESCRIPTION                               | KEYBINDING  |
|--------------------------+-------------------------------------------+-------------|
| comment-line             | /Comment or uncomment lines/                | SPC TAB TAB |
| hl-line-mode             | /Toggle line highlighting in current frame/ | SPC t h     |
| global-hl-line-mode      | /Toggle line highlighting globally/         | SPC t H     |
| doom/toggle-line-numbers | /Toggle line numbers/                       | SPC t l     |
| toggle-truncate-lines    | /Toggle truncate lines/                     | SPC t t     |

#+BEGIN_SRC emacs-lisp
;;(add-hook org-mode
;;(setq display-line-numbers-type nil)
;;)
(setq display-line-numbers-type 1)
(map! :leader
      :desc "Comment or uncomment lines" "TAB TAB" #'comment-line
      (:prefix ("t" . "toggle")
       :desc "Toggle line numbers" "l" #'doom/toggle-line-numbers
       :desc "Toggle line highlight in frame" "h" #'hl-line-mode
       :desc "Toggle line highlight globally" "H" #'global-hl-line-mode
       :desc "Toggle truncate lines" "t" #'toggle-truncate-lines))
#+END_SRC

** Rainbow Mode
Rainbow mode displays the actual color for any hex value color.  It's such a nice feature that I wanted it turned on all the time, regardless of what mode I am in.  The following creates a global minor mode for rainbow-mode and enables it (exception: org-agenda-mode since rainbow-mode destroys all highlighting in org-agenda).

#+begin_src emacs-lisp
(define-globalized-minor-mode global-rainbow-mode rainbow-mode
  (lambda ()
    (when (not (memq major-mode
                (list 'org-agenda-mode)))
     (rainbow-mode 1))))
(global-rainbow-mode 1 )
#+end_src

** xWidgets-Browser
#+begin_src emacs-lisp
(map!
 :leader
 (:desc "Open Xwidgets URL" "y" #'xwidget-webkit-browse-url))
#+end_src

** Elfeed
An RSS newsfeed reader for Emacs.
#+BEGIN_SRC emacs-lisp
(use-package elfeed-goodies
  :init
  (elfeed-goodies/setup)
  :config
  (setq elfeed-goodies/entry-pane-size 0.5))

(add-hook 'elfeed-show-mode-hook 'visual-line-mode)
(evil-define-key 'normal elfeed-show-mode-map
  (kbd "J") 'elfeed-goodies/split-show-next
  (kbd "K") 'elfeed-goodies/split-show-prev)
(evil-define-key 'normal elfeed-search-mode-map
  (kbd "J") 'elfeed-goodies/split-show-next
  (kbd "K") 'elfeed-goodies/split-show-prev)

(setq elfeed-feeds (quote
                     (
                     ;; General
                     ("https://frame.work/blog.rss" Framework)
                     ;; Linux
                     ("https://blog.linuxmint.com/?feed=rss2" linux LinuxMint)
                     ("https://archlinux.org/news/" linux Arch)
                     ("https://fedoramagazine.org/feed/" linux Fedora)
                     ("https://endeavouros.com/news/" linux EndeavourOS)
                     ;; Boat Stuff
                     ("https://buffalonickelblog.com/feed/" Buffalo-Nickle boat)
                     ("https://mobius.world/feed/" Mobius boat)
                     ;; Emacs
                     ("http://xenodium.com/rss.xml" emacs Xenodium)
                     ("https://cmdln.org/post/" emacs Commandline)
                     ("https://karl-voit.at/feeds/lazyblorg-all.atom_1.0.links-and-content.xml" Karal-Voit emacs)
                     ("https://systemcrafters.net/rss/news.xml" emacs SystemCrafter)
                     ("https://sachachua.com/blog/feed/" emacs SachaChua)
                     )))
#+END_SRC

** Pojectile Root
#+begin_src emacs-lisp
(after! projectile (setq projectile-project-root-files-bottom-up (remove ".git"
projectile-project-root-files-bottom-up))
  (lambda ()
    (projectile-add-known-project "~/Documents")
    (projectile-add-known-project "~/Developer/Projects/blog")
    ;; (projectile-add-known-project "~/Developer/Projects/")
  ))
#+end_src

** OPEN SPECIFIC FILES
Keybindings to open files that I work with all the time using the find-file command, which is the interactive file search that opens with 'C-x C-f' in GNU Emacs or 'SPC f f' in Doom Emacs.  These keybindings use find-file non-interactively since we specify exactly what file to open.  The format I use for these bindings is 'SPC =' plus 'key' since Doom Emacs does not use 'SPC ='.

| PATH TO FILE                   | DESCRIPTION           | KEYBINDING |
|--------------------------------+-----------------------+------------|
| ~/Org/agenda.org               | /Edit agenda file/      | SPC = a    |
| ~/.config/doom/config.org      | /Edit doom config.org/  | SPC = c    |
| ~/.config/doom/init.el         | /Edit doom init.el/     | SPC = i    |
| ~/.config/doom/packages.el     | /Edit doom packages.el/ | SPC = p    |
| ~/.config/doom/eshell/aliases  | /Edit eshell aliases/   | SPC = e a  |
| ~/.config/doom/eshell/profile  | /Edit eshell profile/   | SPC = e p  |

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("=" . "open file")
       :desc "Edit agenda file" "a" #'(lambda () (interactive) (find-file "~/Documents/agenda.org"))
       :desc "Edit doom config.org" "c" #'(lambda () (interactive) (find-file "~/.config/doom/config.org"))
       :desc "Edit doom init.el" "i" #'(lambda () (interactive) (find-file "~/.config/doom/init.el"))
       :desc "Edit doom packages.el" "p" #'(lambda () (interactive) (find-file "~/.config/doom/packages.el"))))
(map! :leader
      (:prefix ("= e" . "open eshell files")
       :desc "Edit eshell aliases" "a" #'(lambda () (interactive) (find-file "~/.config/doom/eshell/aliases"))
       :desc "Edit eshell profile" "p" #'(lambda () (interactive) (find-file "~/.config/doom/eshell/profile"))))
#+END_SRC


* WRITING STUFF
** Typing Practice
The typing-practice package runs solely in the minibuffer, so your boss thinks you are working 😊. It utilizes a database of the 1000 most commonly used English words, and let’s you customize how easy or difficult a session will be through a couple of variables. Before long, your hand should have a good feel for all of the most common English morphemes, giving you the foundation to quickly build other words with morphemes you’ve already learned. For example, after you have learned to type the word “the” (the most common English word) you will have a building block for quickly typing “there”, “these”, “their”, “father”, “they”, “other”, “together”, etc.
#+begin_src emacs-lisp
(load "~/.config/doom/typing-practice.el")

(defadvice practice-typing (around no-cursor activate)
  "Do not show cursor at minibuffer during typing practice."
  (let ((minibuffer-setup-hook
         (cons (lambda () (setq cursor-type nil))
               minibuffer-setup-hook)))
    ad-do-it))
#+end_src


** Synosaurus
Synosaurus is a thesaurus fontend for Emacs with pluggable backends.
#+begin_src emacs-lisp
(map!
 :leader
 (:desc "List Synonyms for word at point" "t n" #'synosaurus-choose-and-insert))
#+end_src
** Nov.el
nov.el provides a major mode for reading EPUB documents
#+begin_src emacs-lisp
(setq nov-unzip-program (executable-find "bsdtar")
      nov-unzip-args '("-xC" directory "-f" filename))
(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
#+end_src

** Writegood-Mode
#+begin_src emacs-lisp
(add-hook 'text-mode-hook 'writegood-mode)

(setq gw/weasel-words
      '("actually"
        "basically"
        "easily"
        "easy"
        "simple"
        "simply"))
;; (setq writegood-weasel-words
      ;; (-concat writegood-weasel-words gw/weasel-words))
;; (map!
        ;; :leader
        ;; (:desc ""))
#+end_src

** Writeroom
I think Doom is a bit over-zealous when zooming in.
#+begin_src emacs-lisp
(setq +zen-text-scale 0.8)
#+end_src

** Spell Checker
This is where I set GNU Aspell as my default spell checker.
#+begin_src emacs-lisp
(use-package jinx
  :hook (emacs-startup . global-jinx-mode))

(map! :leader
      (:desc "Check Word" "s w" #'jinx-correct))
#+end_src

** Olivetti
#+begin_src emacs-lisp
(setq olivetti-style 'fringes-and-margins)
#+end_src
** Palimpsest-Mode
This minor mode for Emacs provides several strategies to remove text without permanently deleting it. Namely, it provides the following capabilities:
| Keybindings | Action                                         |
|-------------+------------------------------------------------|
| C-c C-r     | Send selected text to the bottom of the buffer |
| C-c C-s     | Send selected text to the top of the buffer    |
| C-c C-q     | Send selected text to a trash file             |

Much like code, the process of writing text is a progression of revisions where content gets transformed and refined. During these iterations, it is often desirable to move text instead of deleting it: you may have written a sentence that doesn't belong in the paragraph you're editing right now, but it might fit somewhere else. Since you don't know where exactly, you'd like to put it out of the way, not discard it entirely. Palimpsest saves you from the traveling back and forth between your current position and the bottom of your document (or another draft or trash document).

Next time you're writing fiction, non-fiction, a journalistic piece or a blog post using Emacs, give palimpsest-mode a try. You might even try it while coding in a functional language, moving stuff around sprightly, aided by an abstraction reminiscent of the Read-Eval-Print loop, yet completely orthogonal.
#+begin_src emacs-lisp
(add-hook 'text-mode-hook 'palimpsest-mode)

;; (map!
       ;; :leader
      ;; (:desc "Palimpsest-Send-Bottom" "n g" palimpsest-send-bottom))
#+end_src

** Grammar Checker
#+begin_src emacs-lisp
;; (require 'flycheck-vale)
;; (flycheck-vale-setup)
(flycheck-mode -1)
#+end_src
** Abbrev-Mode
Auto expansion for Abbrev-mode.
#+begin_src emacs-lisp
;; Enable abbreviation mode
  (dolist (hook '(org-mode-hook
                    text-mode-hook))
      (add-hook hook #'abbrev-mode))
#+end_src
* PROGRAMMING STUFF
