.config/doom/config.el

(setq user-full-name "Gardner Berry"
    user-mail-address "gardner@gardnerberry.com")

;; (use-package emojify
  ;; :hook (after-init . global-emojify-mode))

;;(add-hook org-mode
;;(setq display-line-numbers-type nil)
;;)
(setq display-line-numbers-type 1)
(map! :leader
      :desc "Comment or uncomment lines" "TAB TAB" #'comment-line
      (:prefix ("t" . "toggle")
       :desc "Toggle line numbers" "l" #'doom/toggle-line-numbers
       :desc "Toggle line highlight in frame" "h" #'hl-line-mode
       :desc "Toggle line highlight globally" "H" #'global-hl-line-mode
       :desc "Toggle truncate lines" "t" #'toggle-truncate-lines))

(define-globalized-minor-mode global-rainbow-mode rainbow-mode
  (lambda ()
    (when (not (memq major-mode
                (list 'org-agenda-mode)))
     (rainbow-mode 1))))
(global-rainbow-mode 1 )

(map!
 :leader
 (:desc "Open Xwidgets URL" "y" #'xwidget-webkit-browse-url))

(use-package elfeed-goodies
  :init
  (elfeed-goodies/setup)
  :config
  (setq elfeed-goodies/entry-pane-size 0.5))

(add-hook 'elfeed-show-mode-hook 'visual-line-mode)
(evil-define-key 'normal elfeed-show-mode-map
  (kbd "J") 'elfeed-goodies/split-show-next
  (kbd "K") 'elfeed-goodies/split-show-prev)
(evil-define-key 'normal elfeed-search-mode-map
  (kbd "J") 'elfeed-goodies/split-show-next
  (kbd "K") 'elfeed-goodies/split-show-prev)

(setq elfeed-feeds (quote
                     (
                     ;; General
                     ("https://frame.work/blog.rss" Framework)
                     ;; Linux
                     ("https://blog.linuxmint.com/?feed=rss2" linux LinuxMint)
                     ("https://archlinux.org/news/" linux Arch)
                     ("https://fedoramagazine.org/feed/" linux Fedora)
                     ("https://endeavouros.com/news/" linux EndeavourOS)
                     ;; Boat Stuff
                     ("https://buffalonickelblog.com/feed/" Buffalo-Nickle boat)
                     ("https://mobius.world/feed/" Mobius boat)
                     ;; Emacs
                     ("http://xenodium.com/rss.xml" emacs Xenodium)
                     ("https://cmdln.org/post/" emacs Commandline)
                     ("https://karl-voit.at/feeds/lazyblorg-all.atom_1.0.links-and-content.xml" Karal-Voit emacs)
                     ("https://systemcrafters.net/rss/news.xml" emacs SystemCrafter)
                     ("https://sachachua.com/blog/feed/" emacs SachaChua)
                     )))

(after! projectile (setq projectile-project-root-files-bottom-up (remove ".git"
projectile-project-root-files-bottom-up))
  (lambda ()
    (projectile-add-known-project "~/Documents")
    (projectile-add-known-project "~/Developer/Projects/blog")
    ;; (projectile-add-known-project "~/Developer/Projects/")
  ))

(map! :leader
      (:prefix ("=" . "open file")
       :desc "Edit agenda file" "a" #'(lambda () (interactive) (find-file "~/Documents/agenda.org"))
       :desc "Edit doom config.org" "c" #'(lambda () (interactive) (find-file "~/.config/doom/config.org"))
       :desc "Edit doom init.el" "i" #'(lambda () (interactive) (find-file "~/.config/doom/init.el"))
       :desc "Edit doom packages.el" "p" #'(lambda () (interactive) (find-file "~/.config/doom/packages.el"))))
(map! :leader
      (:prefix ("= e" . "open eshell files")
       :desc "Edit eshell aliases" "a" #'(lambda () (interactive) (find-file "~/.config/doom/eshell/aliases"))
       :desc "Edit eshell profile" "p" #'(lambda () (interactive) (find-file "~/.config/doom/eshell/profile"))))

(load "~/.config/doom/typing-practice.el")

(defadvice practice-typing (around no-cursor activate)
  "Do not show cursor at minibuffer during typing practice."
  (let ((minibuffer-setup-hook
         (cons (lambda () (setq cursor-type nil))
               minibuffer-setup-hook)))
    ad-do-it))

(map!
 :leader
 (:desc "List Synonyms for word at point" "t n" #'synosaurus-choose-and-insert))

(setq nov-unzip-program (executable-find "bsdtar")
      nov-unzip-args '("-xC" directory "-f" filename))
(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))

(add-hook 'text-mode-hook 'writegood-mode)

(setq gw/weasel-words
      '("actually"
        "basically"
        "easily"
        "easy"
        "simple"
        "simply"))
;; (setq writegood-weasel-words
      ;; (-concat writegood-weasel-words gw/weasel-words))
;; (map!
        ;; :leader
        ;; (:desc ""))

(setq +zen-text-scale 0.8)

(use-package jinx
  :hook (emacs-startup . global-jinx-mode))

(map! :leader
      (:desc "Check Word" "s w" #'jinx-correct))

(setq olivetti-style 'fringes-and-margins)

(add-hook 'text-mode-hook 'palimpsest-mode)

;; (map!
       ;; :leader
      ;; (:desc "Palimpsest-Send-Bottom" "n g" palimpsest-send-bottom))

;; (require 'flycheck-vale)
;; (flycheck-vale-setup)
(flycheck-mode -1)

;; Enable abbreviation mode
  (dolist (hook '(org-mode-hook
                    text-mode-hook))
      (add-hook hook #'abbrev-mode))
